brain/PLM Exam.org
#+BRAIN_PARENTS: PLM

#+TITLE: Portfolio
#+AUTHOR: Kadin Buckton
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+OPTIONS: toc:nil num:nil
#+LATEX_HEADER: \usepackage{apacite}

* Self and Others
** Who am I?
*** Brief Biography
**** Family Members
***** Immediate Family
****** Living with me
******* Mother
        
        Krista Parker
        
******* Stepfather
        
        Jeremy Yourchuk
        
******* Brother
        
        Kyran Parker
        
****** Living with my dad
******* Stepmother
        
        Louise Roy
        
******* Father
        
        Christopher Buckton
        
******* Brothers
        
        Noah, Nathen and Nolan Buckton-Roy
        
**** Friends
***** Alexander Morin

      My best friend, do everything together

**** Girlfriend
***** Liliana Rhein

      Been together for roughly three years. Plan on living together after College/University

**** Pets
***** Living with me
****** Dogs

       Kiara and Kazer. Kiara is a female yellow lab with infinite energy. Once swam across the haviland lake without breaking a sweat, had to be picked up in a canoe. Kazer is a male black lab, a little more relaxed than his girlfriend. Was attacked by another dog, puncturing his back and injuring his knee. Recovered well, and is back to running around, albeit a little slower than Kiara.

****** Cat

       We originally had two cats, Toby and Kya. Toby ended up running off one day and never came back. Kya is a black/grey cat, very cuddly. Will sleep on you if you let her.

***** Living with dad
****** Dogs

       Two little Shiatsu/Pomeranian mixes, both female, love to lick peoples faces. When shaved, they look like little teddy bears.

****** Bearded Dragons

       Originally we had 1, then another, then another until we ended up with 5 of these funny lizards. Unfortunately, Louise found out that she was allergic to them and was forced to give 3 of them away. Now only the original (little buddy, who isn't very little anymore) and Kevin (the angry one, only lets me pet him some days) remain. Love baths and running around chasing the dogs.

****** Fish

       I don't think any of the fish actually have names. Nathen has a beta fish, and there is a tank of misc. fish in the living room. They are fun to look at, and serve as occasional food for the next pet on the list

****** Turtle

       Our turtle, who happens to be named Turtle, spends most of his day under his basking lamp. However when he's not basking, he's swimming around chasing fish, and looking at you as you walk by his tank.

**** Schools Attended
***** Greenwood Elementary School

      Attended from JK to Grade 6. Enjoyed (most) of my time there, good teachers. Still talk to my Grade 6 teacher (Mrs. Wilcox) sometimes whenever I pop in to say hello. Moved to the Korah 7/8 program the first year it was created, half to escape the bullying that had started and half for the computer labs. 

***** Korah Collegiate and Vocational School

      Have been attending Korah since Grade 7. Currently enrolled, this semester taking Foods, Personal Life Management, Advanced Functions and Computer Science. In fact, this is actually an exam for my Personal Life Management class, don't tell anybody! Teachers here are great, (most of) the people are super nice, and I met my best friend (Alex) in grade 7 here. 

**** Sports

     I've tried most sports; Soccer, Baseball, Football, Badminton, however the only sport that really ever stuck was Hockey. Started when I was a kid, and I've been playing ever since. Next year is my last year, excepting College/University hockey. Hopefully going into Midget AA, will have to see how I do in drafts.

**** Personality Traits

     - Good at analyzing situations
     - Quiet / Introverted
     - Don't like having a schedule
     - Curious / Inquisitive

**** Hobbies

     Some of my hobbies include; Computer Programming, Hockey, Video Gaming, Biking, and Hiking.

