brain/PLM Exam.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Portfolio</title>
<meta name="author" content="(Kadin Buckton)"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Portfolio</h1><h2 class="author">Kadin Buckton</h2><p class="date">Created: 2017-06-23 Fri 09:38</p>
</section>

<section>
<section id="slide-org1ab937a">
<h2 id="org1ab937a">Self and Others</h2>
<div class="outline-text-2" id="text-org1ab937a">
</div></section>
<section id="slide-orgee2187f">
<h3 id="orgee2187f">Who am I?</h3>
<div class="outline-text-3" id="text-orgee2187f">
</div></section>
<section id="slide-org1454e8a">
<h4 id="org1454e8a">Brief Biography</h4>
<div class="outline-text-4" id="text-org1454e8a">
</div><ul class="org-ul"><li><a id="org943cde0"></a>Family Members<br /><ul class="org-ul"><li><a id="org27c3f37"></a>Immediate Family<br /><ul class="org-ul"><li><a id="org8b8e88b"></a>Living with me<br /><ul class="org-ul"><li><a id="orgbaa8b48"></a>Mother<br /><p>
Krista Parker
</p></li>

<li><a id="orgb957bb6"></a>Stepfather<br /><p>
Jeremy Yourchuk
</p></li>

<li><a id="org8a44fb8"></a>Brother<br /><p>
Kyran Parker
</p>

</section>
<section ></li></ul></li>
<li><a id="orgfbf2f5a"></a>Living with my dad<br /><ul class="org-ul"><li><a id="org45aa15f"></a>Stepmother<br /><p>
Louise Roy
</p></li>

<li><a id="org134533b"></a>Father<br /><p>
Christopher Buckton
</p></li>

<li><a id="org4a7de1e"></a>Brothers<br /><p>
Noah, Nathen and Nolan Buckton-Roy
</p></li></ul></li></ul></li></ul></li>

<li><a id="org03dead4"></a>Friends<br /><ul class="org-ul"><li><a id="orgb08a951"></a>Alexander Morin<br /><p>
My best friend, do everything together
</p></li></ul></li>

<li><a id="orgdfc190f"></a>Girlfriend<br /><ul class="org-ul"><li><a id="org5319d4b"></a>Liliana Rhein<br /><p>
Been together for roughly three years. Plan on living together after College/University
</p></li></ul></li>

<li><a id="org6e363e4"></a>Pets<br /><ul class="org-ul"><li><a id="org679d78d"></a>Living with me<br /><ul class="org-ul"><li><a id="orgfcbc1a6"></a>Dogs<br /><p>
Kiara and Kazer. Kiara is a female yellow lab with infinite energy. Once swam across the haviland lake without breaking a sweat, had to be picked up in a canoe. Kazer is a male black lab, a little more relaxed than his girlfriend. Was attacked by another dog, puncturing his back and injuring his knee. Recovered well, and is back to running around, albeit a little slower than Kiara.
</p></li>

<li><a id="orgc4545ac"></a>Cat<br /><p>
We originally had two cats, Toby and Kya. Toby ended up running off one day and never came back. Kya is a black/grey cat, very cuddly. Will sleep on you if you let her.
</p></li></ul></li>

<li><a id="org1c9f103"></a>Living with dad<br /><ul class="org-ul"><li><a id="org1eea8e0"></a>Dogs<br /><p>
Two little Shiatsu/Pomeranian mixes, both female, love to lick peoples faces. When shaved, they look like little teddy bears.
</p></li>

<li><a id="org9d78eb4"></a>Bearded Dragons<br /><p>
Originally we had 1, then another, then another until we ended up with 5 of these funny lizards. Unfortunately, Louise found out that she was allergic to them and was forced to give 3 of them away. Now only the original (little buddy, who isn't very little anymore) and Kevin (the angry one, only lets me pet him some days) remain. Love baths and running around chasing the dogs.
</p></li>

<li><a id="orgda14de4"></a>Fish<br /><p>
I don't think any of the fish actually have names. Nathen has a beta fish, and there is a tank of misc. fish in the living room. They are fun to look at, and serve as occasional food for the next pet on the list
</p></li>

<li><a id="org88330a5"></a>Turtle<br /><p>
Our turtle, who happens to be named Turtle, spends most of his day under his basking lamp. However when he's not basking, he's swimming around chasing fish, and looking at you as you walk by his tank.
</p></li></ul></li></ul></li>

<li><a id="org4bbe892"></a>Schools Attended<br /><ul class="org-ul"><li><a id="org356a2b1"></a>Greenwood Elementary School<br /><p>
Attended from JK to Grade 6. Enjoyed (most) of my time there, good teachers. Still talk to my Grade 6 teacher (Mrs. Wilcox) sometimes whenever I pop in to say hello. Moved to the Korah 7/8 program the first year it was created, half to escape the bullying that had started and half for the computer labs. 
</p></li>

<li><a id="orga07d87b"></a>Korah Collegiate and Vocational School<br /><p>
Have been attending Korah since Grade 7. Currently enrolled, this semester taking Foods, Personal Life Management, Advanced Functions and Computer Science. In fact, this is actually an exam for my Personal Life Management class, don't tell anybody! Teachers here are great, (most of) the people are super nice, and I met my best friend (Alex) in grade 7 here. 
</p></li></ul></li>

<li><a id="org713abff"></a>Sports<br /><p>
I've tried most sports; Soccer, Baseball, Football, Badminton, however the only sport that really ever stuck was Hockey. Started when I was a kid, and I've been playing ever since. Next year is my last year, excepting College/University hockey. Hopefully going into Midget AA, will have to see how I do in drafts.
</p></li>

<li><a id="orgfe746db"></a>Personality Traits<br /><ul>
<li>Good at analyzing situations</li>
<li>Quiet / Introverted</li>
<li>Don't like having a schedule</li>
<li>Curious / Inquisitive</li>

</ul></li>

<li><a id="org960678e"></a>Hobbies<br /><p>
Some of my hobbies include; Computer Programming, Hockey, Video Gaming, Biking, and Hiking.
</p></li>
