brain/PLM Exam.tex
% Created 2017-06-23 Fri 09:44
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{booktabs}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{apacite}
\author{Kadin Buckton}
\date{\today}
\title{Portfolio}
\hypersetup{
 pdfauthor={Kadin Buckton},
 pdftitle={Portfolio},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.6)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Self and Others}
\label{sec:orgaa9ed88}
\subsection*{Who am I?}
\label{sec:orgb4cad6d}
\subsubsection*{Brief Biography}
\label{sec:org4e97e07}
\begin{itemize}
\item Family Members
\label{sec:orgf6bc0c3}
\begin{itemize}
\item Immediate Family
\label{sec:org9033694}
\begin{itemize}
\item Living with me
\label{sec:orgc6fb8f4}
\begin{itemize}
\item Mother
\label{sec:orgd70aa56}

Krista Parker

\item Stepfather
\label{sec:org8b9b6ee}

Jeremy Yourchuk

\item Brother
\label{sec:org886b712}

Kyran Parker
\end{itemize}

\item Living with my dad
\label{sec:org8ade15a}
\begin{itemize}
\item Stepmother
\label{sec:org9f2e0e0}

Louise Roy

\item Father
\label{sec:org170906b}

Christopher Buckton

\item Brothers
\label{sec:org4f75eab}

Noah, Nathen and Nolan Buckton-Roy
\end{itemize}
\end{itemize}
\end{itemize}

\item Friends
\label{sec:org0805063}
\begin{itemize}
\item Alexander Morin
\label{sec:org205082c}

My best friend, do everything together
\end{itemize}

\item Girlfriend
\label{sec:org0f793f1}
\begin{itemize}
\item Liliana Rhein
\label{sec:org11fb004}

Been together for roughly three years. Plan on living together after College/University
\end{itemize}

\item Pets
\label{sec:orgcf236e0}
\begin{itemize}
\item Living with me
\label{sec:org6bb1e2c}
\begin{itemize}
\item Dogs
\label{sec:org2c4b53a}

Kiara and Kazer. Kiara is a female yellow lab with infinite energy. Once swam across the haviland lake without breaking a sweat, had to be picked up in a canoe. Kazer is a male black lab, a little more relaxed than his girlfriend. Was attacked by another dog, puncturing his back and injuring his knee. Recovered well, and is back to running around, albeit a little slower than Kiara.

\item Cat
\label{sec:org3662cc4}

We originally had two cats, Toby and Kya. Toby ended up running off one day and never came back. Kya is a black/grey cat, very cuddly. Will sleep on you if you let her.
\end{itemize}

\item Living with dad
\label{sec:org20d1582}
\begin{itemize}
\item Dogs
\label{sec:org6153a88}

Two little Shiatsu/Pomeranian mixes, both female, love to lick peoples faces. When shaved, they look like little teddy bears.

\item Bearded Dragons
\label{sec:org551993c}

Originally we had 1, then another, then another until we ended up with 5 of these funny lizards. Unfortunately, Louise found out that she was allergic to them and was forced to give 3 of them away. Now only the original (little buddy, who isn't very little anymore) and Kevin (the angry one, only lets me pet him some days) remain. Love baths and running around chasing the dogs.

\item Fish
\label{sec:org125309e}

I don't think any of the fish actually have names. Nathen has a beta fish, and there is a tank of misc. fish in the living room. They are fun to look at, and serve as occasional food for the next pet on the list

\item Turtle
\label{sec:orgd370d66}

Our turtle, who happens to be named Turtle, spends most of his day under his basking lamp. However when he's not basking, he's swimming around chasing fish, and looking at you as you walk by his tank.
\end{itemize}
\end{itemize}

\item Schools Attended
\label{sec:orgec6556d}
\begin{itemize}
\item Greenwood Elementary School
\label{sec:org1ba5937}

Attended from JK to Grade 6. Enjoyed (most) of my time there, good teachers. Still talk to my Grade 6 teacher (Mrs. Wilcox) sometimes whenever I pop in to say hello. Moved to the Korah 7/8 program the first year it was created, half to escape the bullying that had started and half for the computer labs. 

\item Korah Collegiate and Vocational School
\label{sec:org3719425}

Have been attending Korah since Grade 7. Currently enrolled, this semester taking Foods, Personal Life Management, Advanced Functions and Computer Science. In fact, this is actually an exam for my Personal Life Management class, don't tell anybody! Teachers here are great, (most of) the people are super nice, and I met my best friend (Alex) in grade 7 here.
\end{itemize}

\item Sports
\label{sec:orga1233e3}

I've tried most sports; Soccer, Baseball, Football, Badminton, however the only sport that really ever stuck was Hockey. Started when I was a kid, and I've been playing ever since. Next year is my last year, excepting College/University hockey. Hopefully going into Midget AA, will have to see how I do in drafts.

\item Personality Traits
\label{sec:org78beb7c}

\begin{itemize}
\item Good at analyzing situations
\item Quiet / Introverted
\item Don't like having a schedule
\item Curious / Inquisitive
\end{itemize}

\item Hobbies
\label{sec:orgb658553}

Some of my hobbies include; Computer Programming, Hockey, Video Gaming, Biking, and Hiking.
