brain/PLM Exam.org
**** Post Secondary Plans

     Currently up in the air about this, was planning for a while to go into the Computer Science course at Algoma U, but recently have been exploring the Computer Security field as a future career. Will most likely either go to Algoma University or Sault College, for the fact that it is cheaper to remain in the city rather than go somewhere else for my post secondary. 

*** Famous Quote or Proverb that describes my personality and/or outlook on life

    #+BEGIN_QUOTE
    Do not take life too seriously. You will never get out of it alive. --Elbert Hubbard
    #+END_QUOTE
    This quote describes my outlook on life fairly well. Take things as they come, and it helps me remember that whatever happens today, it will seem inconsequential in a few years so why should I stress over it?

** Resources
*** Human Resources in my life
**** Liliana
***** How do you know them?

      She's my girlfriend, for 3 years.

***** How do they help you?

      She reminds me every day that there are people that care about me, and inspires me to achieve any goal that I set for myself.

***** How do you get ahold of them?

      I call her. On the telephone. Or over the internet.

**** Alexander Morin
***** How do you know them?

      I've known him ever since grade 7, when I moved here (Korah) for the 7/8 program. Since then we've been (mostly) inseparable, playing video games and just hanging out. I also occasionally scribe for him, because he has dyslexia, and finds it very hard to write.

***** How do they help you?

      He helps me remember to relax sometimes, unwind over a barbecue together and helps me focus on what I want to do in life.

***** How do you get ahold of them?

      Talk to him at school, or call him. On the telephone. Or over the internet.

*** Personal Resources
**** Skills

     - Adept at technology
     - Strategist
     - Intelligent
     - Management

**** Interests

     - Coding
     - Video Games
     - Books
     - Music
     - Cool Creepy Things

**** Health/Fitness

     Reasonably fit, can lift 140+ lbs, which is almost my body weight, which is 164 lbs. At 5'11, this gives me a BMI of 22, or with the newer SBMI, 37/70. Both of which are in the healthy range. This is going to help me as I work towards independence because I wont have to worry about increased health risks, and can do more without becoming fatigued.

** Goals
*** Identify and explain 2 short term goals (one year or less)
**** Get more physically fit

Because I'm going to be going into AA hockey next year, I want to get into better physical shape, so that I can play better than the rest of them. I also just want to feel healthier, which I believe getting more physically fit will accomplish.

**** Save up some money

I want to start saving for college. Due to the fact that my family has done so much for me, I'd really prefer it I could pay my own way through college, add to relieve some of the financial burden on my family. It would also be nice to feel more independent.

*** Identify and explain 1 long term goal (one year or longer) and create a SMART goal plan for it
**** 
*** Describe the lifestyle you hope to have when you're 30 years old
**** City

     Phoenix, Arizona

**** Home

     Doesn't really matter, as long as it has a pool.

**** Job

     Something in the Computer Security field. Currently looking at the Computer Security Analyst role, which pays an average of $75k a year.

**** Family

     Liliana Rhein, Single Child, preferably a boy (don't tell Lili I said that).

**** Vehicle

     A black Impala.

**** Pets

     A Corgi, Lizards, and a Pacman Frog.

**** Finances

     Something around 75k$ a year for myself.

** Communication
*** Overview of your oral communication ability as it relates to conversing with both people you know, as well as people you do not know
**** People you know

I'm very confident when talking to people I know well.

**** People you don't know

Communication with people I don't know well has been a struggle I'm trying to overcome. When I first start talking with someone I don't know, I'm usually very reserved, and have a few nervous habits including stuttering.

