brain/PLM Exam.html

<li><a id="orge71c035"></a>Post Secondary Plans<br /><p>
Currently up in the air about this, was planning for a while to go into the Computer Science course at Algoma U, but recently have been exploring the Computer Security field as a future career. Will most likely either go to Algoma University or Sault College, for the fact that it is cheaper to remain in the city rather than go somewhere else for my post secondary. 
</p></li></ul>

</section>
<section id="slide-orgfb82bbe">
<h4 id="orgfb82bbe">Famous Quote or Proverb that describes my personality and/or outlook on life</h4>
<blockquote nil>
<p>
Do not take life too seriously. You will never get out of it alive. &#x2013;Elbert Hubbard
</p>
</blockquote>
<p>
This quote describes my outlook on life fairly well. Take things as they come, and it helps me remember that whatever happens today, it will seem inconsequential in a few years so why should I stress over it?
</p>

</section>
<section id="slide-orgb6d3cac">
<h3 id="orgb6d3cac">Resources</h3>
<div class="outline-text-3" id="text-orgb6d3cac">
</div></section>
<section id="slide-orga2a7ea5">
<h4 id="orga2a7ea5">Human Resources in my life</h4>
<div class="outline-text-4" id="text-orga2a7ea5">
</div><ul class="org-ul"><li><a id="orga90c1ba"></a>Liliana<br /><ul class="org-ul"><li><a id="org3be95bf"></a>How do you know them?<br /><p>
She's my girlfriend, for 3 years.
</p></li>

<li><a id="org677f618"></a>How do they help you?<br /><p>
She reminds me every day that there are people that care about me, and inspires me to achieve any goal that I set for myself.
</p></li>

<li><a id="org5bc6deb"></a>How do you get ahold of them?<br /><p>
I call her. On the telephone. Or over the internet.
</p></li></ul></li>

<li><a id="org773fd85"></a>Alexander Morin<br /><ul class="org-ul"><li><a id="orgf941a36"></a>How do you know them?<br /><p>
I've known him ever since grade 7, when I moved here (Korah) for the 7/8 program. Since then we've been (mostly) inseparable, playing video games and just hanging out. I also occasionally scribe for him, because he has dyslexia, and finds it very hard to write.
</p></li>

<li><a id="org870dfb1"></a>How do they help you?<br /><p>
He helps me remember to relax sometimes, unwind over a barbecue together and helps me focus on what I want to do in life.
</p></li>

<li><a id="org2c3f952"></a>How do you get ahold of them?<br /><p>
Talk to him at school, or call him. On the telephone. Or over the internet.
</p></li></ul></li></ul>

</section>
<section id="slide-org12c63ef">
<h4 id="org12c63ef">Personal Resources</h4>
<div class="outline-text-4" id="text-org12c63ef">
</div><ul class="org-ul"><li><a id="org6fcf5ea"></a>Skills<br /><ul>
<li>Adept at technology</li>
<li>Strategist</li>
<li>Intelligent</li>
<li>Management</li>

</ul></li>

<li><a id="org64f024f"></a>Interests<br /><ul>
<li>Coding</li>
<li>Video Games</li>
<li>Books</li>
<li>Music</li>
<li>Cool Creepy Things</li>

</ul></li>

<li><a id="org4340b72"></a>Health/Fitness<br /><p>
Reasonably fit, can lift 140+ lbs, which is almost my body weight, which is 164 lbs. At 5'11, this gives me a BMI of 22, or with the newer SBMI, 37/70. Both of which are in the healthy range. This is going to help me as I work towards independence because I wont have to worry about increased health risks, and can do more without becoming fatigued.
</p></li></ul>

</section>
<section id="slide-org9aeb4f4">
<h3 id="org9aeb4f4">Goals</h3>
<div class="outline-text-3" id="text-org9aeb4f4">
</div></section>
<section id="slide-org4670755">
<h4 id="org4670755">Identify and explain 2 short term goals (one year or less)</h4>
<div class="outline-text-4" id="text-org4670755">
</div><ul class="org-ul"><li><a id="orga9440db"></a>Get more physically fit<br /><p>
Because I'm going to be going into AA hockey next year, I want to get into better physical shape, so that I can play better than the rest of them. I also just want to feel healthier, which I believe getting more physically fit will accomplish.
</p></li>

<li><a id="org7132aec"></a>Save up some money<br /><p>
I want to start saving for college. Due to the fact that my family has done so much for me, I'd really prefer it I could pay my own way through college, add to relieve some of the financial burden on my family. It would also be nice to feel more independent.
</p></li></ul>

</section>
<section id="slide-org04675d6">
<h4 id="org04675d6">Identify and explain 1 long term goal (one year or longer) and create a SMART goal plan for it</h4>
<div class="outline-text-4" id="text-org04675d6">
</div><ul class="org-ul"><li><a id="org3c62c42"></a><br /></li></ul>
</section>
<section id="slide-org6afb9aa">
<h4 id="org6afb9aa">Describe the lifestyle you hope to have when you're 30 years old</h4>
<div class="outline-text-4" id="text-org6afb9aa">
</div><ul class="org-ul"><li><a id="org0ca3065"></a>City<br /><p>
Phoenix, Arizona
</p></li>

<li><a id="org6db01fa"></a>Home<br /><p>
Doesn't really matter, as long as it has a pool.
</p></li>

<li><a id="orgd2f9063"></a>Job<br /><p>
Something in the Computer Security field. Currently looking at the Computer Security Analyst role, which pays an average of $75k a year.
</p></li>

<li><a id="orgba53681"></a>Family<br /><p>
Liliana Rhein, Single Child, preferably a boy (don't tell Lili I said that).
</p></li>

<li><a id="orgf4a0526"></a>Vehicle<br /><p>
A black Impala.
</p></li>

<li><a id="orgfa47e43"></a>Pets<br /><p>
A Corgi, Lizards, and a Pacman Frog.
</p></li>

<li><a id="orgd39ad9f"></a>Finances<br /><p>
Something around 75k$ a year for myself.
</p></li></ul>

</section>
<section id="slide-org8dcfa4f">
<h3 id="org8dcfa4f">Communication</h3>
<div class="outline-text-3" id="text-org8dcfa4f">
</div></section>
<section id="slide-orgf9b6312">
<h4 id="orgf9b6312">Overview of your oral communication ability as it relates to conversing with both people you know, as well as people you do not know</h4>
<div class="outline-text-4" id="text-orgf9b6312">
</div><ul class="org-ul"><li><a id="orgca74bca"></a>People you know<br /><p>
I'm very confident when talking to people I know well.
</p></li>

<li><a id="org92bd8d5"></a>People you don't know<br /><p>
Communication with people I don't know well has been a struggle I'm trying to overcome. When I first start talking with someone I don't know, I'm usually very reserved, and have a few nervous habits including stuttering.
</p></li>
