brain/PLM Exam.tex

\item Post Secondary Plans
\label{sec:org92db5e7}

Currently up in the air about this, was planning for a while to go into the Computer Science course at Algoma U, but recently have been exploring the Computer Security field as a future career. Will most likely either go to Algoma University or Sault College, for the fact that it is cheaper to remain in the city rather than go somewhere else for my post secondary.
\end{itemize}

\subsubsection*{Famous Quote or Proverb that describes my personality and/or outlook on life}
\label{sec:org81066f1}

\begin{quote}
Do not take life too seriously. You will never get out of it alive. --Elbert Hubbard
\end{quote}
This quote describes my outlook on life fairly well. Take things as they come, and it helps me remember that whatever happens today, it will seem inconsequential in a few years so why should I stress over it?

\subsection*{Resources}
\label{sec:org36028b9}
\subsubsection*{Human Resources in my life}
\label{sec:orga8dd1f2}
\begin{itemize}
\item Liliana
\label{sec:org0fa049f}
\begin{itemize}
\item How do you know them?
\label{sec:org5690a93}

She's my girlfriend, for 3 years.

\item How do they help you?
\label{sec:org4be6e66}

She reminds me every day that there are people that care about me, and inspires me to achieve any goal that I set for myself.

\item How do you get ahold of them?
\label{sec:org33a203c}

I call her. On the telephone. Or over the internet.
\end{itemize}

\item Alexander Morin
\label{sec:orgc6cc950}
\begin{itemize}
\item How do you know them?
\label{sec:orgc639fc5}

I've known him ever since grade 7, when I moved here (Korah) for the 7/8 program. Since then we've been (mostly) inseparable, playing video games and just hanging out. I also occasionally scribe for him, because he has dyslexia, and finds it very hard to write.

\item How do they help you?
\label{sec:org5e6e261}

He helps me remember to relax sometimes, unwind over a barbecue together and helps me focus on what I want to do in life.

\item How do you get ahold of them?
\label{sec:org936ec2c}

Talk to him at school, or call him. On the telephone. Or over the internet.
\end{itemize}
\end{itemize}

\subsubsection*{Personal Resources}
\label{sec:org2d8ab5e}
\begin{itemize}
\item Skills
\label{sec:org89b8621}

\begin{itemize}
\item Adept at technology
\item Strategist
\item Intelligent
\item Management
\end{itemize}

\item Interests
\label{sec:orgba34b2c}

\begin{itemize}
\item Coding
\item Video Games
\item Books
\item Music
\item Cool Creepy Things
\end{itemize}

\item Health/Fitness
\label{sec:orgca7d8a7}

Reasonably fit, can lift 140+ lbs, which is almost my body weight, which is 164 lbs. At 5'11, this gives me a BMI of 22, or with the newer SBMI, 37/70. Both of which are in the healthy range. This is going to help me as I work towards independence because I wont have to worry about increased health risks, and can do more without becoming fatigued.
\end{itemize}

\subsection*{Goals}
\label{sec:org62cb1e0}
\subsubsection*{Identify and explain 2 short term goals (one year or less)}
\label{sec:orgcd2a449}
\begin{itemize}
\item Get more physically fit
\label{sec:org565a22a}

Because I'm going to be going into AA hockey next year, I want to get into better physical shape, so that I can play better than the rest of them. I also just want to feel healthier, which I believe getting more physically fit will accomplish.

\item Save up some money
\label{sec:org8329687}

I want to start saving for college. Due to the fact that my family has done so much for me, I'd really prefer it I could pay my own way through college, add to relieve some of the financial burden on my family. It would also be nice to feel more independent.
\end{itemize}

\subsubsection*{Identify and explain 1 long term goal (one year or longer) and create a SMART goal plan for it}
\label{sec:orge42eebd}
\begin{itemize}
\item 
\label{sec:orgf1816d6}
\end{itemize}
\subsubsection*{Describe the lifestyle you hope to have when you're 30 years old}
\label{sec:org8d5b503}
\begin{itemize}
\item City
\label{sec:org59fa58e}

Phoenix, Arizona

\item Home
\label{sec:org9692501}

Doesn't really matter, as long as it has a pool.

\item Job
\label{sec:orge3bba1b}

Something in the Computer Security field. Currently looking at the Computer Security Analyst role, which pays an average of \$75k a year.

\item Family
\label{sec:orgafad83b}

Liliana Rhein, Single Child, preferably a boy (don't tell Lili I said that).

\item Vehicle
\label{sec:orgfb4d726}

A black Impala.

\item Pets
\label{sec:orgeb87f08}

A Corgi, Lizards, and a Pacman Frog.

\item Finances
\label{sec:orgec2045e}

Something around 75k\$ a year for myself.
\end{itemize}

\subsection*{Communication}
\label{sec:org36ec5dd}
\subsubsection*{Overview of your oral communication ability as it relates to conversing with both people you know, as well as people you do not know}
\label{sec:org6011807}
\begin{itemize}
\item People you know
\label{sec:orgf6779c5}

I'm very confident when talking to people I know well.

\item People you don't know
\label{sec:orgb04de7b}

Communication with people I don't know well has been a struggle I'm trying to overcome. When I first start talking with someone I don't know, I'm usually very reserved, and have a few nervous habits including stuttering.
