brain/PLM Exam.org
**** Styles of communication I use
*** Explain the process of active listening and describe your personal level of competency
    The process of active listening is when you (the listener) is fully concentrated on the speaker, and /actively/ understands, responds, and then remembers what is being said. 
**** In the classroom
     I think my level of competence is fairly high when it comes to active listening in the classroom, with distractions from other students being the main reason for me to become distracted.
**** With peers
     With peers, depending on what we're doing at the time it is occasionally hard for me to focus on exactly what they are saying, and have to periodically ask them to repeat what they just said.
*** Comment on how aware you and confident you are of your non-verbal communication
**** Body language
     I don't usually pay too much attention to my body language, when I'm talking with friends I'm usually very relaxed, whereas when I'm talking to people I don't know I'm generally tense. I don't think it's too bad though.
**** Nervous habits
     Stuttering, mostly. Really bad when I'm addressing a group of people. 
**** Eye contact
     I try to maintain direct eye contact for most of the time if someone is talking directly to me.
**** Personal space
     I'm definitely not a very touchy person, don't usually hug people. Generally the closest I get to someone's personal space is a handshake.
**** Image projection
     I try to project a confident image, though sometimes I don't think I'm very successful. It's something I need to work on, I'm not as competent as I want to be yet. 
** Time Management and Productivity
*** Identify and briefly describe 3 time wasters that you personally experience and know you need to manage better
**** Procrastination
     Just plain procrastination is my Achilles heel. Very bad habit I'm working (so far unsuccessfully) to kick. 
*** Identify and explain one strategy you could implement to be more productive with your time
    Something I've recently been looking at to help is something called the pomodoro technique, which is a time management method that organizes your time into chunks (traditionally 25 minutes) whereupon the time elapsing you take a short break (4-5 minutes). On your fifth break, you take a longer one (15-30 minutes), and then reset your break count to 0. 
* Pathways
** Career/Job Goals(s)
*** Identify and describe a job you would like to have one day and why you would like that job

    A job I would like to have one day is to be an Information Security Analyst. I'd like that job because it involves monitoring networks for security breaches, conduct testing to determine whether or not there are any security holes in a system, and help plan and conduct security procedures.

*** Describe specifically what education, skills, and personal attributes you will need to do that job

    Typically a Bachelor's Degree is required, along with related experience in the same field. Some skills needed include analytical skills, the need to be detail oriented, have problem solving skills and ingenuity. 

** Job Search and Interview Preparation
*** Identify some different ways people go about finding jobs and describe how you (or a friend/parent/sibling) found their job

    I don't have any siblings or friends with jobs, so I can't speak for that part. Some of the ways people go about finding jobs, however, I can speak for.

**** Online

     A (relatively) newer way of finding jobs involves the internet. Recruiters, who are people looking for people looking for jobs, post job openings on different websites, with descriptions, salaries, benefits, and any other information one might want. Then, someone looking for a job can go to these websites, and submit resumes either online or in person (by going to the store that is hiring), which brings me to the next way.

**** In-Person

     Sometimes stores don't have all this fancy internet stuff. In these cases, if one was looking for a job they might see a store with a "We're Hiring" sign in their window. Then this person would go into the store with a resume, and give it to the manager (or whoever handles hiring at the company). This method usually makes you look better than the online method, though I don't have any anecdotal evidence to prove it. 

