brain/PLM Exam.html

<li><a id="org7392b33"></a>Styles of communication I use<br /></li></ul>
</section>
<section id="slide-orgb140068">
<h4 id="orgb140068">Explain the process of active listening and describe your personal level of competency</h4>
<p>
The process of active listening is when you (the listener) is fully concentrated on the speaker, and <i>actively</i> understands, responds, and then remembers what is being said. 
</p>
<ul class="org-ul"><li><a id="org39abb5d"></a>In the classroom<br /><p>
I think my level of competence is fairly high when it comes to active listening in the classroom, with distractions from other students being the main reason for me to become distracted.
</p></li>
<li><a id="orgcb213d2"></a>With peers<br /><p>
With peers, depending on what we're doing at the time it is occasionally hard for me to focus on exactly what they are saying, and have to periodically ask them to repeat what they just said.
</p></li></ul>
</section>
<section id="slide-org49b4912">
<h4 id="org49b4912">Comment on how aware you and confident you are of your non-verbal communication</h4>
<div class="outline-text-4" id="text-org49b4912">
</div><ul class="org-ul"><li><a id="org52c6254"></a>Body language<br /><p>
I don't usually pay too much attention to my body language, when I'm talking with friends I'm usually very relaxed, whereas when I'm talking to people I don't know I'm generally tense. I don't think it's too bad though.
</p></li>
<li><a id="orgbfc678c"></a>Nervous habits<br /><p>
Stuttering, mostly. Really bad when I'm addressing a group of people. 
</p></li>
<li><a id="org14c5f1e"></a>Eye contact<br /><p>
I try to maintain direct eye contact for most of the time if someone is talking directly to me.
</p></li>
<li><a id="org5d2d6fa"></a>Personal space<br /><p>
I'm definitely not a very touchy person, don't usually hug people. Generally the closest I get to someone's personal space is a handshake.
</p></li>
<li><a id="orgd842968"></a>Image projection<br /><p>
I try to project a confident image, though sometimes I don't think I'm very successful. It's something I need to work on, I'm not as competent as I want to be yet. 
</p></li></ul>
</section>
<section id="slide-orgab9f611">
<h3 id="orgab9f611">Time Management and Productivity</h3>
<div class="outline-text-3" id="text-orgab9f611">
</div></section>
<section id="slide-org3a178a6">
<h4 id="org3a178a6">Identify and briefly describe 3 time wasters that you personally experience and know you need to manage better</h4>
<div class="outline-text-4" id="text-org3a178a6">
</div><ul class="org-ul"><li><a id="org7b5f491"></a>Procrastination<br /><p>
Just plain procrastination is my Achilles heel. Very bad habit I'm working (so far unsuccessfully) to kick. 
</p></li></ul>
</section>
<section id="slide-orgc6193df">
<h4 id="orgc6193df">Identify and explain one strategy you could implement to be more productive with your time</h4>
<p>
Something I've recently been looking at to help is something called the pomodoro technique, which is a time management method that organizes your time into chunks (traditionally 25 minutes) whereupon the time elapsing you take a short break (4-5 minutes). On your fifth break, you take a longer one (15-30 minutes), and then reset your break count to 0. 
</p>
</section>
</section>
<section>
<section id="slide-orgd538e1b">
<h2 id="orgd538e1b">Pathways</h2>
<div class="outline-text-2" id="text-orgd538e1b">
</div></section>
<section id="slide-org0aa924f">
<h3 id="org0aa924f">Career/Job Goals(s)</h3>
<div class="outline-text-3" id="text-org0aa924f">
</div></section>
<section id="slide-org1169c74">
<h4 id="org1169c74">Identify and describe a job you would like to have one day and why you would like that job</h4>
<p>
A job I would like to have one day is to be an Information Security Analyst. I'd like that job because it involves monitoring networks for security breaches, conduct testing to determine whether or not there are any security holes in a system, and help plan and conduct security procedures.
</p>

</section>
<section id="slide-org8afcbd3">
<h4 id="org8afcbd3">Describe specifically what education, skills, and personal attributes you will need to do that job</h4>
<p>
Typically a Bachelor's Degree is required, along with related experience in the same field. Some skills needed include analytical skills, the need to be detail oriented, have problem solving skills and ingenuity. 
</p>

</section>
<section id="slide-org600a355">
<h3 id="org600a355">Job Search and Interview Preparation</h3>
<div class="outline-text-3" id="text-org600a355">
</div></section>
<section id="slide-org319fc58">
<h4 id="org319fc58">Identify some different ways people go about finding jobs and describe how you (or a friend/parent/sibling) found their job</h4>
<p>
I don't have any siblings or friends with jobs, so I can't speak for that part. Some of the ways people go about finding jobs, however, I can speak for.
</p>

<ul class="org-ul"><li><a id="orgf77735c"></a>Online<br /><p>
A (relatively) newer way of finding jobs involves the internet. Recruiters, who are people looking for people looking for jobs, post job openings on different websites, with descriptions, salaries, benefits, and any other information one might want. Then, someone looking for a job can go to these websites, and submit resumes either online or in person (by going to the store that is hiring), which brings me to the next way.
</p></li>

<li><a id="org660c737"></a>In-Person<br /><p>
Sometimes stores don't have all this fancy internet stuff. In these cases, if one was looking for a job they might see a store with a "We're Hiring" sign in their window. Then this person would go into the store with a resume, and give it to the manager (or whoever handles hiring at the company). This method usually makes you look better than the online method, though I don't have any anecdotal evidence to prove it. 
</p></li>
