brain/PLM Exam.tex

\item Styles of communication I use
\label{sec:orgb126d6d}
\end{itemize}
\subsubsection*{Explain the process of active listening and describe your personal level of competency}
\label{sec:org38a61ae}
The process of active listening is when you (the listener) is fully concentrated on the speaker, and \emph{actively} understands, responds, and then remembers what is being said. 
\begin{itemize}
\item In the classroom
\label{sec:orga9687f8}
I think my level of competence is fairly high when it comes to active listening in the classroom, with distractions from other students being the main reason for me to become distracted.
\item With peers
\label{sec:org641b423}
With peers, depending on what we're doing at the time it is occasionally hard for me to focus on exactly what they are saying, and have to periodically ask them to repeat what they just said.
\end{itemize}
\subsubsection*{Comment on how aware you and confident you are of your non-verbal communication}
\label{sec:orgf54a076}
\begin{itemize}
\item Body language
\label{sec:org4e5d688}
I don't usually pay too much attention to my body language, when I'm talking with friends I'm usually very relaxed, whereas when I'm talking to people I don't know I'm generally tense. I don't think it's too bad though.
\item Nervous habits
\label{sec:orgab2daa8}
Stuttering, mostly. Really bad when I'm addressing a group of people. 
\item Eye contact
\label{sec:org59e5f2f}
I try to maintain direct eye contact for most of the time if someone is talking directly to me.
\item Personal space
\label{sec:org01e7fd1}
I'm definitely not a very touchy person, don't usually hug people. Generally the closest I get to someone's personal space is a handshake.
\item Image projection
\label{sec:org37a234b}
I try to project a confident image, though sometimes I don't think I'm very successful. It's something I need to work on, I'm not as competent as I want to be yet.
\end{itemize}
\subsection*{Time Management and Productivity}
\label{sec:org1767bbf}
\subsubsection*{Identify and briefly describe 3 time wasters that you personally experience and know you need to manage better}
\label{sec:org50ea9d0}
\begin{itemize}
\item Procrastination
\label{sec:orgc7d04bd}
Just plain procrastination is my Achilles heel. Very bad habit I'm working (so far unsuccessfully) to kick.
\end{itemize}
\subsubsection*{Identify and explain one strategy you could implement to be more productive with your time}
\label{sec:org7194164}
Something I've recently been looking at to help is something called the pomodoro technique, which is a time management method that organizes your time into chunks (traditionally 25 minutes) whereupon the time elapsing you take a short break (4-5 minutes). On your fifth break, you take a longer one (15-30 minutes), and then reset your break count to 0. 
\section*{Pathways}
\label{sec:org4f399d1}
\subsection*{Career/Job Goals(s)}
\label{sec:org5990ca6}
\subsubsection*{Identify and describe a job you would like to have one day and why you would like that job}
\label{sec:orgef71641}

A job I would like to have one day is to be an Information Security Analyst. I'd like that job because it involves monitoring networks for security breaches, conduct testing to determine whether or not there are any security holes in a system, and help plan and conduct security procedures.

\subsubsection*{Describe specifically what education, skills, and personal attributes you will need to do that job}
\label{sec:org3139629}

Typically a Bachelor's Degree is required, along with related experience in the same field. Some skills needed include analytical skills, the need to be detail oriented, have problem solving skills and ingenuity. 

\subsection*{Job Search and Interview Preparation}
\label{sec:org368ad03}
\subsubsection*{Identify some different ways people go about finding jobs and describe how you (or a friend/parent/sibling) found their job}
\label{sec:org68d3026}

I don't have any siblings or friends with jobs, so I can't speak for that part. Some of the ways people go about finding jobs, however, I can speak for.

\begin{itemize}
\item Online
\label{sec:org21bef6a}

A (relatively) newer way of finding jobs involves the internet. Recruiters, who are people looking for people looking for jobs, post job openings on different websites, with descriptions, salaries, benefits, and any other information one might want. Then, someone looking for a job can go to these websites, and submit resumes either online or in person (by going to the store that is hiring), which brings me to the next way.

\item In-Person
\label{sec:org509811c}

Sometimes stores don't have all this fancy internet stuff. In these cases, if one was looking for a job they might see a store with a "We're Hiring" sign in their window. Then this person would go into the store with a resume, and give it to the manager (or whoever handles hiring at the company). This method usually makes you look better than the online method, though I don't have any anecdotal evidence to prove it. 
