brain/PLM Exam.org
**** Through a Friend or Family Member

     Though much rarer than the previous two, sometimes people just get jobs though a friend or family member. A good example of this is a family business. If my mother ran a grocery store, for example, I don't think she would make me submit a resume in order to stock shelves. 

*** Include an edited version of your resume here

    [[file:/home/kadin/Downloads/Kadin%20Parker%20Resume%20-%20Any.pdf][Resume]]

* Finance
** Budgeting and Saving
*** Describe what the term "budgeting" means and the importance of budgeting. Include a blank budget table.

    #+BEGIN_QUOTE  
    budg·et
    verb
    gerund or present participle: budgeting
    allow or provide a particular amount of money in a budget.
    "the university is budgeting for a deficit"
    synonyms:	allocate, allot, allow, earmark, designate, set aside
    "we have to budget $7,000 for the work"

    provide (a sum of money) for a particular purpose from a budget.
    "the council proposes to budget $100,000 to provide grants"
    #+END_QUOTE

    One of the importance's of budgeting is to make sure that you have enough money for everything, and that you're not spending more money than you are making.

*** Identify 3 advantages for saving money and reflect personally on how well you save money
**** More Money

When you save money, you're going to have more money available to you. This means you'll eventually be able to afford some more expensive things, whatever you want as long as you're willing to save for it.

**** Less Stress

With more money comes the peace of mind knowing that if you or someone you love end up with an emergency expense, or if suddenly your rent or another bill increases, you'll be able to afford it.

**** Better Things

Also with more money comes the opportunity to buy better things. For example, if your washing machine is on the fritz and you have no money, you'll have to just deal with it (or wash by hand). However if you are saving money, you might have enough for a new washing machine.

**** Personal Reflection

I don't really have any money to spend at the moment. When I do get a job, I have a plan in place to put a certain percentage of my paycheck into a savings account, to save up for things like college, our insurance.

** Pay Stubs
*** Describe the type of information presented on a pay stub

The pay stub includes your total earnings for the pay period, any deductions, and your net pay

*** Explain why it is important to review your pay stubs regularly, and the possible risks of not checking your pay stubs

It's important to review your pay stubs regularly so that you can verify how much you're getting paid, and that there aren't any deductions there shouldn't be. A risk of not checking your pay stubs is you being deducted something you shouldn't be, or not being paid the correct amount. 

** Credit Cards and Debt
*** Describe the pros and cons of credit cards and whether or not you wish to have one someday - Why or Why Not?
**** Pros

One of the most important pros of a credit card, in my opinion, is that you can buy expensive things, such as a house, and then repay that bit by bit. Another pro is being able to shop online.

**** Cons

One of the biggest cons of owning a credit card is that it is extremely easy to go into massive amounts of debt. 

**** Do I want one?

I wouldn't say I want one, because if I could do without it I would, however it is basically required if I want to own a house or car, along with any other items that would be hard to pay for in cash. I also think that I have learned enough to not go into debt using one, so I'm not too worried about it.

** Smart Shopping
*** Identify 3 strategies you should use when shopping to ensure you are getting the best deals for your dollars
**** Coupons

     One of the best ways to save money is to not pay full price on things. There are almost always coupons in stores and online that allow you to save upwards of 30% on everyday items.

**** Sales

Why spend $10 when you can spend $5 on the same thing? Buying things when they are on sale seems like a small thing, however it quickly adds up. 

**** Buying Bulk

Generally, buying bulk is a lot cheaper than anything else. While you can't do this as often as you can do the previous two things, it will also add up over time.

