brain/PLM Exam.html

<li><a id="orgf02bd6c"></a>Through a Friend or Family Member<br /><p>
Though much rarer than the previous two, sometimes people just get jobs though a friend or family member. A good example of this is a family business. If my mother ran a grocery store, for example, I don't think she would make me submit a resume in order to stock shelves. 
</p></li></ul>

</section>
<section id="slide-org951aaed">
<h4 id="org951aaed">Include an edited version of your resume here</h4>
<p>
<a href="file:///home/kadin/Downloads/Kadin%20Parker%20Resume%20-%20Any.pdf">Resume</a>
</p>

</section>
</section>
<section>
<section id="slide-orgc0f04b7">
<h2 id="orgc0f04b7">Finance</h2>
<div class="outline-text-2" id="text-orgc0f04b7">
</div></section>
<section id="slide-org00c2efa">
<h3 id="org00c2efa">Budgeting and Saving</h3>
<div class="outline-text-3" id="text-org00c2efa">
</div></section>
<section id="slide-org2c72d4f">
<h4 id="org2c72d4f">Describe what the term "budgeting" means and the importance of budgeting. Include a blank budget table.</h4>
<blockquote nil>
<p>
budg·et
verb
gerund or present participle: budgeting
allow or provide a particular amount of money in a budget.
"the university is budgeting for a deficit"
synonyms:	allocate, allot, allow, earmark, designate, set aside
"we have to budget $7,000 for the work"
</p>

<p>
provide (a sum of money) for a particular purpose from a budget.
"the council proposes to budget $100,000 to provide grants"
</p>
</blockquote>

<p>
One of the importance's of budgeting is to make sure that you have enough money for everything, and that you're not spending more money than you are making.
</p>

</section>
<section id="slide-org8e38e81">
<h4 id="org8e38e81">Identify 3 advantages for saving money and reflect personally on how well you save money</h4>
<div class="outline-text-4" id="text-org8e38e81">
</div><ul class="org-ul"><li><a id="orgd86fd04"></a>More Money<br /><p>
When you save money, you're going to have more money available to you. This means you'll eventually be able to afford some more expensive things, whatever you want as long as you're willing to save for it.
</p></li>

<li><a id="org8d9a7b4"></a>Less Stress<br /><p>
With more money comes the peace of mind knowing that if you or someone you love end up with an emergency expense, or if suddenly your rent or another bill increases, you'll be able to afford it.
</p></li>

<li><a id="orgbf39a0b"></a>Better Things<br /><p>
Also with more money comes the opportunity to buy better things. For example, if your washing machine is on the fritz and you have no money, you'll have to just deal with it (or wash by hand). However if you are saving money, you might have enough for a new washing machine.
</p></li>

<li><a id="org8a5b71e"></a>Personal Reflection<br /><p>
I don't really have any money to spend at the moment. When I do get a job, I have a plan in place to put a certain percentage of my paycheck into a savings account, to save up for things like college, our insurance.
</p></li></ul>

</section>
<section id="slide-orgfa97934">
<h3 id="orgfa97934">Pay Stubs</h3>
<div class="outline-text-3" id="text-orgfa97934">
</div></section>
<section id="slide-org44baf96">
<h4 id="org44baf96">Describe the type of information presented on a pay stub</h4>
<p>
The pay stub includes your total earnings for the pay period, any deductions, and your net pay
</p>

</section>
<section id="slide-org97f358c">
<h4 id="org97f358c">Explain why it is important to review your pay stubs regularly, and the possible risks of not checking your pay stubs</h4>
<p>
It's important to review your pay stubs regularly so that you can verify how much you're getting paid, and that there aren't any deductions there shouldn't be. A risk of not checking your pay stubs is you being deducted something you shouldn't be, or not being paid the correct amount. 
</p>

</section>
<section id="slide-orgd483480">
<h3 id="orgd483480">Credit Cards and Debt</h3>
<div class="outline-text-3" id="text-orgd483480">
</div></section>
<section id="slide-org6af7f43">
<h4 id="org6af7f43">Describe the pros and cons of credit cards and whether or not you wish to have one someday - Why or Why Not?</h4>
<div class="outline-text-4" id="text-org6af7f43">
</div><ul class="org-ul"><li><a id="org4a3c7d6"></a>Pros<br /><p>
One of the most important periods of a credit card, in my opinion, is that you can buy expensive things, such as a house, and then repay that bit by bit. Another pro is being able to shop online.
</p></li>

<li><a id="orgb34286b"></a>Cons<br /><p>
One of the biggest cons of owning a credit card is that it is extremely easy to go into massive amounts of debt. 
</p></li>

<li><a id="org052b41f"></a>Do I want one?<br /><p>
I wouldn't say I want one, because if I could do without it I would, however it is basically required if I want to own a house or car, along with any other items that would be hard to pay for in cash. I also think that I have learned enough to not go into debt using one, so I'm not too worried about it.
</p></li></ul>

</section>
<section id="slide-org6963478">
<h3 id="org6963478">Smart Shopping</h3>
<div class="outline-text-3" id="text-org6963478">
</div></section>
<section id="slide-orgb71ebcf">
<h4 id="orgb71ebcf">Identify 3 strategies you should use when shopping to ensure you are getting the best deals for your dollars</h4>
<div class="outline-text-4" id="text-orgb71ebcf">
</div><ul class="org-ul"><li><a id="org7865600"></a>Coupons<br /><p>
One of the best ways to save money is to not pay full price on things. There are almost always coupons in stores and online that allow you to save upwards of 30% on everyday items.
</p></li>

<li><a id="org2fb68e8"></a>Sales<br /><p>
Why spend $10 when you can spend $5 on the same thing? Buying things when they are on sale seems like a small thing, however it quickly adds up. 
</p></li>

<li><a id="orga6cbe16"></a>Buying Bulk<br /><p>
Generally, buying bulk is a lot cheaper than anything else. While you can't do this as often as you can do the previous two things, it will also add up over time.
</p></li></ul>

</section>
