brain/PLM Exam.tex

\item Through a Friend or Family Member
\label{sec:org8eb85a0}

Though much rarer than the previous two, sometimes people just get jobs though a friend or family member. A good example of this is a family business. If my mother ran a grocery store, for example, I don't think she would make me submit a resume in order to stock shelves.
\end{itemize}

\subsubsection*{Include an edited version of your resume here}
\label{sec:org98aa005}

\href{file:///home/kadin/Downloads/Kadin\%20Parker\%20Resume\%20-\%20Any.pdf}{Resume}

\section*{Finance}
\label{sec:org6e9d3a6}
\subsection*{Budgeting and Saving}
\label{sec:org118d6b1}
\subsubsection*{Describe what the term "budgeting" means and the importance of budgeting. Include a blank budget table.}
\label{sec:org41db049}

\begin{quote}
budg·et
verb
gerund or present participle: budgeting
allow or provide a particular amount of money in a budget.
"the university is budgeting for a deficit"
synonyms:	allocate, allot, allow, earmark, designate, set aside
"we have to budget \$7,000 for the work"

provide (a sum of money) for a particular purpose from a budget.
"the council proposes to budget \$100,000 to provide grants"
\end{quote}

One of the importance's of budgeting is to make sure that you have enough money for everything, and that you're not spending more money than you are making.

\subsubsection*{Identify 3 advantages for saving money and reflect personally on how well you save money}
\label{sec:orgf153b57}
\begin{itemize}
\item More Money
\label{sec:orgf38ef78}

When you save money, you're going to have more money available to you. This means you'll eventually be able to afford some more expensive things, whatever you want as long as you're willing to save for it.

\item Less Stress
\label{sec:org2348a0c}

With more money comes the peace of mind knowing that if you or someone you love end up with an emergency expense, or if suddenly your rent or another bill increases, you'll be able to afford it.

\item Better Things
\label{sec:org3d71b74}

Also with more money comes the opportunity to buy better things. For example, if your washing machine is on the fritz and you have no money, you'll have to just deal with it (or wash by hand). However if you are saving money, you might have enough for a new washing machine.

\item Personal Reflection
\label{sec:org431c3c3}

I don't really have any money to spend at the moment. When I do get a job, I have a plan in place to put a certain percentage of my paycheck into a savings account, to save up for things like college, our insurance.
\end{itemize}

\subsection*{Pay Stubs}
\label{sec:org31b6315}
\subsubsection*{Describe the type of information presented on a pay stub}
\label{sec:org0890f3c}

The pay stub includes your total earnings for the pay period, any deductions, and your net pay

\subsubsection*{Explain why it is important to review your pay stubs regularly, and the possible risks of not checking your pay stubs}
\label{sec:orgbcd775c}

It's important to review your pay stubs regularly so that you can verify how much you're getting paid, and that there aren't any deductions there shouldn't be. A risk of not checking your pay stubs is you being deducted something you shouldn't be, or not being paid the correct amount. 

\subsection*{Credit Cards and Debt}
\label{sec:orgeeb17e8}
\subsubsection*{Describe the pros and cons of credit cards and whether or not you wish to have one someday - Why or Why Not?}
\label{sec:org829bafd}
\begin{itemize}
\item Pros
\label{sec:org5436cb4}

One of the most important periods of a credit card, in my opinion, is that you can buy expensive things, such as a house, and then repay that bit by bit. Another pro is being able to shop online.

\item Cons
\label{sec:orgdad8d14}

One of the biggest cons of owning a credit card is that it is extremely easy to go into massive amounts of debt. 

\item Do I want one?
\label{sec:org6cea920}

I wouldn't say I want one, because if I could do without it I would, however it is basically required if I want to own a house or car, along with any other items that would be hard to pay for in cash. I also think that I have learned enough to not go into debt using one, so I'm not too worried about it.
\end{itemize}

\subsection*{Smart Shopping}
\label{sec:orgce482b5}
\subsubsection*{Identify 3 strategies you should use when shopping to ensure you are getting the best deals for your dollars}
\label{sec:org3290d3a}
\begin{itemize}
\item Coupons
\label{sec:org24b12df}

One of the best ways to save money is to not pay full price on things. There are almost always coupons in stores and online that allow you to save upwards of 30\% on everyday items.

\item Sales
\label{sec:org3f51fff}

Why spend \$10 when you can spend \$5 on the same thing? Buying things when they are on sale seems like a small thing, however it quickly adds up. 

\item Buying Bulk
\label{sec:orgfc01a91}

Generally, buying bulk is a lot cheaper than anything else. While you can't do this as often as you can do the previous two things, it will also add up over time.
\end{itemize}
