brain/PLM Exam.org
*** Describe the level of confidence you have in distinguishing your "needs" from your "wants" /and/ utilizing strategies to ensure all of your clothing and food needs will be met, once you're living on your own

    If we're using an 'out of 10' system, I would rate my confidence as a solid 10. 

* Community and World
** Values
*** Identify and describe 4 values that you have
**** Spirituality
     Recently, I've become to value greater and greater my own spirituality, and deciding what I personally believe in. 
**** Knowledge
     One of the biggest things I value is knowledge, I think that the pursuit of knowledge is one of the best things you can pursue in life.
**** Growth
     I'm of the opinion that without growth there is no point in life. Why would I want to continue living if I'm going to be the same person for 80 years? Personal growth is very important to me, and I want to continue to grow as a person until I die. 
**** Contribution
     If there is one thing that is validating in life, it's contributing to the better of society. Knowing that, whatever happens, you've made a positive change to someone's life is a very fulfilling thing. 
*** Comment on how these 4 values influence your decision making
    Sometimes (regrettably) I don't always keep these values in mind while making decisions, though I've been trying to recently. I feel that while keeping these values in mind, I make better decisions than I would otherwise.
** Decision Making
*** Explain which decision making style you most often use for tough decisions and why you use it
    When making tough decisions, I usually use the analytical decision making style. I use it because I'm very fact based, and I think that some of the best decisions are made using the data that is right in front of you.
*** Identify and describe /one/ example of a bad decision that you made and which decision making style you used to make it.
    A bad decision I made was to do the Chem and Physics courses offered at the school. I used a directive decision making style, which focused on the short-term rather than the long-term. 
**** Were there any consequences from it that affected you or others?
     Only affected me, though I ended up losing two credits because of it.
*** Identify and describe /one/ example of a good decision that you made and which decision making style you used to make it.
    A good decision I have made was to drop the IB program. The decision style I used was analytical, looking at the data that was presented to me and decided that it wasn't the right path for me. 
**** Did this decision affect anyone besides yourself? If so, how?
     Didn't affect anyone besides myself.
** World Impact
*** Identify 1 decision you have made that has world impact (may start within the home and reach community or the world). Think of things like purchasing cheap clothing, using antibiotics, recycling, using environmental cleaners, smoking, etc.
    I recycle a lot, which helps the environment.
*** Explain how these decisions affect you, people close to the situation, companies or cities
    It makes me feel a lot better knowing that I'm helping the environment by not putting recyclable materials in the dump, and it keeps the recycling company in business.
** Resources
*** Identify 2 community resources you use or may have to use. Include a brief description
**** Library
     I've made quite extensive use of the library, as I am an avid reader of books. It has been very helpful for me in my quest of knowledge, and I have been called a bookworm by a few people.
**** Hockey Arenas
     As hockey is one of my loves, I've been in every single hockey arena in the Sault as well as a couple in the states since I was 5. It helps me unwind, and stay fit. 
* Household Management
** Toxin Free Products
*** Complete a list of 5 products that are common in households that are toxic to us and list a healthy alternative to each one
