brain/PLM Exam.html
<section id="slide-org801d04e">
<h4 id="org801d04e">Describe the level of confidence you have in distinguishing your "needs" from your "wants" <i>and</i> utilizing strategies to ensure all of your clothing and food needs will be met, once you're living on your own</h4>
<p>
If we're using an 'out of 10' system, I would rate my confidence as a solid 10. 
</p>

</section>
</section>
<section>
<section id="slide-org61a3595">
<h2 id="org61a3595">Community and World</h2>
<div class="outline-text-2" id="text-org61a3595">
</div></section>
<section id="slide-org79a958a">
<h3 id="org79a958a">Values</h3>
<div class="outline-text-3" id="text-org79a958a">
</div></section>
<section id="slide-org64c3283">
<h4 id="org64c3283">Identify and describe 4 values that you have</h4>
<div class="outline-text-4" id="text-org64c3283">
</div><ul class="org-ul"><li><a id="org527c966"></a>Spirituality<br /><p>
Recently, I've become to value greater and greater my own spirituality, and deciding what I personally believe in. 
</p></li>
<li><a id="orgbe76ab6"></a>Knowledge<br /><p>
One of the biggest things I value is knowledge, I think that the pursuit of knowledge is one of the best things you can pursue in life.
</p></li>
<li><a id="org5cc6acb"></a>Growth<br /><p>
I'm of the opinion that without growth there is no point in life. Why would I want to continue living if I'm going to be the same person for 80 years? Personal growth is very important to me, and I want to continue to grow as a person until I die. 
</p></li>
<li><a id="org0098808"></a>Contribution<br /><p>
If there is one thing that is validating in life, it's contributing to the better of society. Knowing that, whatever happens, you've made a positive change to someone's life is a very fulfilling thing. 
</p></li></ul>
</section>
<section id="slide-org8acd4d7">
<h4 id="org8acd4d7">Comment on how these 4 values influence your decision making</h4>
<p>
Sometimes (regrettably) I don't always keep these values in mind while making decisions, though I've been trying to recently. I feel that while keeping these values in mind, I make better decisions than I would otherwise.
</p>
</section>
<section id="slide-orga0f7c67">
<h3 id="orga0f7c67">Decision Making</h3>
<div class="outline-text-3" id="text-orga0f7c67">
</div></section>
<section id="slide-org982e8b4">
<h4 id="org982e8b4">Explain which decision making style you most often use for tough decisions and why you use it</h4>
<p>
When making tough decisions, I usually use the analytical decision making style. I use it because I'm very fact based, and I think that some of the best decisions are made using the data that is right in front of you.
</p>
</section>
<section id="slide-org95ecc96">
<h4 id="org95ecc96">Identify and describe <i>one</i> example of a bad decision that you made and which decision making style you used to make it.</h4>
<p>
A bad decision I made was to do the Chem and Physics courses offered at the school. I used a directive decision making style, which focused on the short-term rather than the long-term. 
</p>
<ul class="org-ul"><li><a id="orgf74df4d"></a>Were there any consequences from it that affected you or others?<br /><p>
Only affected me, though I ended up losing two credits because of it.
</p></li></ul>
</section>
<section id="slide-org3d665b1">
<h4 id="org3d665b1">Identify and describe <i>one</i> example of a good decision that you made and which decision making style you used to make it.</h4>
<p>
A good decision I have made was to drop the IB program. The decision style I used was analytical, looking at the data that was presented to me and decided that it wasn't the right path for me. 
</p>
<ul class="org-ul"><li><a id="org801d72d"></a>Did this decision affect anyone besides yourself? If so, how?<br /><p>
Didn't affect anyone besides myself.
</p></li></ul>
</section>
<section id="slide-org369fc19">
<h3 id="org369fc19">World Impact</h3>
<div class="outline-text-3" id="text-org369fc19">
</div></section>
<section id="slide-org141b43e">
<h4 id="org141b43e">Identify 1 decision you have made that has world impact (may start within the home and reach community or the world). Think of things like purchasing cheap clothing, using antibiotics, recycling, using environmental cleaners, smoking, etc.</h4>
<p>
I recycle a lot, which helps the environment.
</p>
</section>
<section id="slide-org1fd6899">
<h4 id="org1fd6899">Explain how these decisions affect you, people close to the situation, companies or cities</h4>
<p>
It makes me feel a lot better knowing that I'm helping the environment by not putting recyclable materials in the dump, and it keeps the recycling company in business.
</p>
</section>
<section id="slide-org9f07fa3">
<h3 id="org9f07fa3">Resources</h3>
<div class="outline-text-3" id="text-org9f07fa3">
</div></section>
<section id="slide-orgbfc8aae">
<h4 id="orgbfc8aae">Identify 2 community resources you use or may have to use. Include a brief description</h4>
<div class="outline-text-4" id="text-orgbfc8aae">
</div><ul class="org-ul"><li><a id="org263a05b"></a>Library<br /><p>
I've made quite extensive use of the library, as I am an avid reader of books. It has been very helpful for me in my quest of knowledge, and I have been called a bookworm by a few people.
</p></li>
<li><a id="org6139afe"></a>Hockey Arenas<br /><p>
As hockey is one of my loves, I've been in every single hockey arena in the Sault as well as a couple in the states since I was 5. It helps me unwind, and stay fit. 
</p></li></ul>
</section>
</section>
<section>
<section id="slide-orgd1e23e4">
<h2 id="orgd1e23e4">Household Management</h2>
<div class="outline-text-2" id="text-orgd1e23e4">
</div></section>
<section id="slide-org29dc205">
<h3 id="org29dc205">Toxin Free Products</h3>
<div class="outline-text-3" id="text-org29dc205">
</div></section>
<section id="slide-org5bd3932">
<h4 id="org5bd3932">Complete a list of 5 products that are common in households that are toxic to us and list a healthy alternative to each one</h4>
<div class="outline-text-4" id="text-org5bd3932">
</div><ul class="org-ul"><li><a id="org5f34d0f"></a>Air Fresheners<br /><p>
