brain/PLM Exam.tex

\subsubsection*{Describe the level of confidence you have in distinguishing your "needs" from your "wants" \emph{and} utilizing strategies to ensure all of your clothing and food needs will be met, once you're living on your own}
\label{sec:orge794b32}

If we're using an 'out of 10' system, I would rate my confidence as a solid 10. 

\section*{Community and World}
\label{sec:org01fe35b}
\subsection*{Values}
\label{sec:org1db1ce4}
\subsubsection*{Identify and describe 4 values that you have}
\label{sec:org418e8c1}
\begin{itemize}
\item Spirituality
\label{sec:orgc77c3c9}
Recently, I've become to value greater and greater my own spirituality, and deciding what I personally believe in. 
\item Knowledge
\label{sec:orgde0db99}
One of the biggest things I value is knowledge, I think that the pursuit of knowledge is one of the best things you can pursue in life.
\item Growth
\label{sec:org912b363}
I'm of the opinion that without growth there is no point in life. Why would I want to continue living if I'm going to be the same person for 80 years? Personal growth is very important to me, and I want to continue to grow as a person until I die. 
\item Contribution
\label{sec:org6528c81}
If there is one thing that is validating in life, it's contributing to the better of society. Knowing that, whatever happens, you've made a positive change to someone's life is a very fulfilling thing.
\end{itemize}
\subsubsection*{Comment on how these 4 values influence your decision making}
\label{sec:org1bed05d}
Sometimes (regrettably) I don't always keep these values in mind while making decisions, though I've been trying to recently. I feel that while keeping these values in mind, I make better decisions than I would otherwise.
\subsection*{Decision Making}
\label{sec:org84953ee}
\subsubsection*{Explain which decision making style you most often use for tough decisions and why you use it}
\label{sec:org03a95e2}
When making tough decisions, I usually use the analytical decision making style. I use it because I'm very fact based, and I think that some of the best decisions are made using the data that is right in front of you.
\subsubsection*{Identify and describe \emph{one} example of a bad decision that you made and which decision making style you used to make it.}
\label{sec:orge06426f}
A bad decision I made was to do the Chem and Physics courses offered at the school. I used a directive decision making style, which focused on the short-term rather than the long-term. 
\begin{itemize}
\item Were there any consequences from it that affected you or others?
\label{sec:org9c29b78}
Only affected me, though I ended up losing two credits because of it.
\end{itemize}
\subsubsection*{Identify and describe \emph{one} example of a good decision that you made and which decision making style you used to make it.}
\label{sec:orga838988}
A good decision I have made was to drop the IB program. The decision style I used was analytical, looking at the data that was presented to me and decided that it wasn't the right path for me. 
\begin{itemize}
\item Did this decision affect anyone besides yourself? If so, how?
\label{sec:org324efa7}
Didn't affect anyone besides myself.
\end{itemize}
\subsection*{World Impact}
\label{sec:org728e1df}
\subsubsection*{Identify 1 decision you have made that has world impact (may start within the home and reach community or the world). Think of things like purchasing cheap clothing, using antibiotics, recycling, using environmental cleaners, smoking, etc.}
\label{sec:org37387c5}
I recycle a lot, which helps the environment.
\subsubsection*{Explain how these decisions affect you, people close to the situation, companies or cities}
\label{sec:org7381660}
It makes me feel a lot better knowing that I'm helping the environment by not putting recyclable materials in the dump, and it keeps the recycling company in business.
\subsection*{Resources}
\label{sec:org5d877c4}
\subsubsection*{Identify 2 community resources you use or may have to use. Include a brief description}
\label{sec:org6a93956}
\begin{itemize}
\item Library
\label{sec:org9dd5ab1}
I've made quite extensive use of the library, as I am an avid reader of books. It has been very helpful for me in my quest of knowledge, and I have been called a bookworm by a few people.
\item Hockey Arenas
\label{sec:org987d920}
As hockey is one of my loves, I've been in every single hockey arena in the Sault as well as a couple in the states since I was 5. It helps me unwind, and stay fit.
\end{itemize}
\section*{Household Management}
\label{sec:org7fd8571}
\subsection*{Toxin Free Products}
\label{sec:org90a52dc}
\subsubsection*{Complete a list of 5 products that are common in households that are toxic to us and list a healthy alternative to each one}
\label{sec:org0dfc1d2}
\begin{itemize}
\item Air Fresheners
\label{sec:orgfc1e984}
