brain/PLM Exam.org
**** Air Fresheners
     Many air fresheners contain phthalates, which are known to be endocrine disruptors.Men with higher phthalate compounds in their blood had correspondingly reduced sperm counts. What is the healthier choice? Essential oils work well, as does just opening the windows. Another way to detoxify the air is to add more plants to your home. \cite{experience}
**** Carpet Cleaners
     A common ingredient in carpet cleaners is perchloroethylene, which happens to be a neurotoxin. It is also a possible carcinogen, so it is really something you don't want in your body. The healthier choice is to use a nontoxic brand, such as Ecover, or use undiluted castile soap. \cite{experience} 
**** Multipurpose Cleaners
     Many multipurpose cleaners include 2-butoxyethanol, which gives them their sweet smell. It can also cause sore throats when inhaled, and in high levels contributes to narcosis, pulmonary edema, and severe liver and kidney damage. A healthier option is to stick with simple cleaning compounds like Bon Ami powder; it's made from natural ingredients like group feldspar and baking soda without the added bleach or fragrances found in most commercial cleaners. \cite{experience}
**** Polishing Agents
     Due to the fact that when ammonia evaporates it doesn't leave streaks, it is a common ingredient in window cleaners. Also commonly, it makes it harder to breath, especially in people with preexisting lung issues. It can also create a poisonous gas when mixed with bleach. The healthier alternative is to shine with Vodka, it leaves a reflective shine on any metal / mirrored surface. \cite{experience}
**** Oven Cleaners
     A common ingredient is Sodium Hydroxide, also known as lye. It is extremely corrosive, burning your skin or eyes if it makes contact. The healthier way to clean even the grimiest oven is with baking-soda paste. \cite{experience}
*** Choose your favorite product and include a recipe to make the product using healthy home ingredients. Include the original product, the recipe, an image and at least 1 potential benefits
    While maybe not my /absolute/ favorite product, I think an important product to make with healthy ingredients is a multipurpose cleaner, because of the fact that you use it almost everywhere. The recipe to make this is simple:
    - 1 tsp borax
    - 1/2 tsp washing soda
    - 1 tsp liquid castille soap
    - Essential oils of choice
    - Spray Bottle
      
    The instructions are also simple:
    1. Place borax, washing soda and soap in a spray bottle
    2. Add 2 cups of warm water. Cover bottle and shake well, use as needed.

    One potential benefit of using this is that it's harmless if you child accidentally consumes some of it, which means it's safe to use on their toys.
    
\bibliography{/home/kadin/bibtex/references.bib}{}
\bibliographystyle{apacite}
#  LocalWords:  ahold disruptors


